Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir.Direction
A fixed direction in UV-space. The parameter will drive
the segment's angle relative to this direction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: direction has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2012